{
  "backend/main.mo": "Defines studio data types, currency comparison logic, income records, podcasts, events, and reporting structures for the backend actor.",
  "feature_evidence.json": "Specifies feature evidence mappings linking feature IDs to affected frontend files and components with confidence metadata.",
  "frontend-file-summaries.txt": "Lists prewritten summaries for various frontend source files used for reference or documentation.",
  "frontend/index.css": "Tailwind-based global styles defining theme variables and light/dark mode CSS properties.",
  "frontend/index.html": "Base HTML document loading the React frontend via main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router, authentication gating, profile setup, and all application routes within a themed provider.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an error screen for unauthorized users with navigation back to the home page.",
  "frontend/src/components/auth/LoginButton.tsx": "Logout button clearing Internet Identity state, query cache, and role-related session storage values.",
  "frontend/src/components/auth/PostLoginRoleClaimGate.tsx": "Handles post-login role claiming by reading pending requests, attempting the claim, and processing success or error states.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal that lets a user enter their name and saves the profile using a mutation with success and error toasts.",
  "frontend/src/components/auth/RequireRole.tsx": "Wrapper that checks the caller's role and either renders children, a loading spinner, or an access denied screen.",
  "frontend/src/components/layout/AppLayout.tsx": "Application layout with navigation, main content area, and a footer containing studio info and social links.",
  "frontend/src/components/layout/AppNav.tsx": "Top navigation bar showing links based on user role, login status, and a mobile sheet menu.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages the backend actor based on Internet Identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for managing Internet Identity login, stored identities, and login status helpers.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating user profiles, roles, income records, and related backend data.",
  "frontend/src/index.css": "Tailwind CSS base, components, utilities, and theme variables for light and dark modes.",
  "frontend/src/main.tsx": "Application entry point initializing React, query client, Internet Identity provider, and global styles.",
  "frontend/src/pages/admin/RoleManagementPage.tsx": "Provides a form for admins to assign user roles by principal ID with validation and toast feedback.",
  "frontend/src/pages/auth/LoginPage.tsx": "Renders the Internet Identity login screen with studio feature previews and handles role claim error display.",
  "frontend/src/pages/reception/IntakeCompletePage.tsx": "Shows a completion confirmation after a visit is registered and offers navigation to start a new visit or view all visits.",
  "frontend/src/pages/reception/ReceptionVisitFormPage.tsx": "Contains the full visit intake form with validation, podcast guest logic, and submission to create income records.",
  "frontend/src/pages/reception/ReceptionVisitsListPage.tsx": "Displays all visit records with service icons, admin-only clear-history functionality, and navigation to visit details.",
  "frontend/src/pages/reception/VisitDetailsPage.tsx": "Shows detailed information for a single visit including client data, payment status, service icons, and navigation back.",
  "frontend/src/pages/reports/MonthlyReportsPage.tsx": "Renders monthly report charts and selectors for year, month, and currency using fetched analytics data.",
  "frontend/src/pages/services/PhotoVideoDetailsPage.tsx": "Displays and edits photo/video session details for a visit, with form validation and navigation on submit.",
  "frontend/src/pages/services/PodcastDetailsPage.tsx": "Manages podcast session details including dynamic guest list editing and saving via mutation.",
  "frontend/src/pages/services/RecordingDetailsPage.tsx": "Provides a form to view and edit recording session details for a visit with basic validation.",
  "frontend/src/utils/currency.ts": "Defines supported currencies and helpers for formatting, labeling, and totaling monetary amounts.",
  "frontend/src/utils/pendingRoleRequest.ts": "Handles storing, retrieving, and clearing pending role requests and role claim errors in sessionStorage.",
  "frontend/src/utils/phone.ts": "Provides helpers for prefilling and displaying phone number formats with a default country code.",
  "frontend/src/utils/roleLabels.ts": "Maps user roles to display labels and manages storing the selected label in sessionStorage.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading URL parameters, persisting them in sessionStorage, and removing parameters from hash-based routes.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom colors, container settings, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Describes the project state, including existing features, a new feature request, and metadata for a project removing post-login role selection."
}